apache/nuttx/arch/arm/src/stm32h7/stm32_tickless.c
static int stm32_tickless_setchannel(uint8_t channel)
{
  uint16_t ccmr_orig   = 0;
  uint16_t ccmr_val    = 0;
  uint16_t ccmr_mask   = 0xff;
  uint16_t ccer_val    = stm32_getreg16(STM32_GTIM_CCER_OFFSET);
  uint8_t  ccmr_offset = STM32_GTIM_CCMR1_OFFSET;

  /* Further we use range as 0..3; if channel=0 it will also overflow here */

  if (--channel > 4)
    {
      return -EINVAL;
    }

  /* Assume that channel is disabled and polarity is active high */

  ccer_val &= ~((GTIM_CCER_CC1P | GTIM_CCER_CC1E) <<
                GTIM_CCER_CCXBASE(channel));

  /* This function is not supported on basic timers. To enable or
   * disable it, simply set its clock to valid frequency or zero.
   */

  if (g_tickless.base == STM32_TIM6_BASE ||
      g_tickless.base == STM32_TIM7_BASE)
    {
      return -EINVAL;
    }

  /* Frozen mode because we don't want to change the GPIO, preload register
   * disabled.
   */

  ccmr_val = (GTIM_CCMR_MODE_FRZN << GTIM_CCMR1_OC1M_SHIFT);

  /* Set polarity */

  ccer_val |= GTIM_CCER_CC1P << GTIM_CCER_CCXBASE(channel);

  /* Define its position (shift) and get register offset */

  if ((channel & 1) != 0)
    {
      ccmr_val  <<= 8;
      ccmr_mask <<= 8;
    }

  if (channel > 1)
    {
      ccmr_offset = STM32_GTIM_CCMR2_OFFSET;
    }

  ccmr_orig  = stm32_getreg16(ccmr_offset);
  ccmr_orig &= ~ccmr_mask;
  ccmr_orig |= ccmr_val;
  stm32_putreg16(ccmr_offset, ccmr_orig);
  stm32_putreg16(STM32_GTIM_CCER_OFFSET, ccer_val);

  return OK;
}

/****************************************************************************
 * Name: stm32_interval_handler
 *
 * Description:
 *   Called when the timer counter matches the compare register
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called early in the initialization sequence before any special
 *   concurrency protections are required.
 *
 ****************************************************************************/

static void stm32_interval_handler(void)
{
  tmrinfo("Expired...\n");

  /* Disable the compare interrupt now. */

  stm32_tickless_disableint(g_tickless.channel);
  stm32_tickless_ackint(g_tickless.channel);

  g_tickless.pending = false;

  nxsched_process_timer();
}

/****************************************************************************
 * Name: stm32_timing_handler
 *
 * Description:
 *   Timer interrupt callback.  When the freerun timer counter overflows,
 *   this interrupt will occur.  We will just increment an overflow count.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stm32_timing_handler(void)
{
  g_tickless.overflow++;

  STM32_TIM_ACKINT(g_tickless.tch, GTIM_SR_UIF);
}

/****************************************************************************
 * Name: stm32_tickless_handler
 *
 * Description:
 *   Generic interrupt handler for this timer.  It checks the source of the
 *   interrupt and fires the appropriate handler.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static int stm32_tickless_handler(int irq, void *context, void *arg)
{
  int interrupt_flags = stm32_tickless_getint();

  if (interrupt_flags & GTIM_SR_UIF)
    {
      stm32_timing_handler();
    }

  if (interrupt_flags & (1 << g_tickless.channel))
    {
      stm32_interval_handler();
    }

  return OK;
}

#ifdef CONFIG_SCHED_TICKLESS_ALARM
/****************************************************************************
 * Name: stm32_get_counter
 ****************************************************************************/

static uint64_t stm32_get_counter(void)
{
#ifdef HAVE_32BIT_TICKLESS
  return ((uint64_t)g_tickless.overflow << 32) |
         STM32_TIM_GETCOUNTER(g_tickless.tch);
#else
  return ((uint64_t)g_tickless.overflow << 16) |
         STM32_TIM_GETCOUNTER(g_tickless.tch);
#endif
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_timer_initialize
 *
 * Description:
 *   Initializes all platform-specific timer facilities.  This function is
 *   called early in the initialization sequence by up_initialize().
 *   On return, the current up-time should be available from
 *   up_timer_gettime() and the interval timer is ready for use (but not
 *   actively timing.
 *
 *   Provided by platform-specific code and called from the architecture-
 *   specific logic.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called early in the initialization sequence before any special
 *   concurrency protections are required.
 *
 ****************************************************************************/

void up_timer_initialize(void)
{
  switch (CONFIG_STM32_TICKLESS_TIMER)
    {
#ifdef CONFIG_STM32_TIM1
      case 1:
        g_tickless.base = STM32_TIM1_BASE;
        modifyreg32(STM32_DBGMCU_APB2FZ1, 0, DBGMCU_APB2Z1_TIM1STOP);
        break;
#endif

#ifdef CONFIG_STM32_TIM2
      case 2:
        g_tickless.base = STM32_TIM2_BASE;
        modifyreg32(STM32_DBGMCU_APB1LFZ1, 0, DBGMCU_APB1L_TIM2STOP);
        break;
#endif

#ifdef CONFIG_STM32_TIM3
      case 3:
        g_tickless.base = STM32_TIM3_BASE;
        modifyreg32(STM32_DBGMCU_APB1LFZ1, 0, DBGMCU_APB1L_TIM3STOP);
        break;
#endif

#ifdef CONFIG_STM32_TIM4
      case 4:
        g_tickless.base = STM32_TIM4_BASE;
        modifyreg32(STM32_DBGMCU_APB1LFZ1, 0, DBGMCU_APB1L_TIM4STOP);
        break;
#endif
#ifdef CONFIG_STM32_TIM5
      case 5:
        g_tickless.base = STM32_TIM5_BASE;
        modifyreg32(STM32_DBGMCU_APB1LFZ1, 0, DBGMCU_APB1L_TIM5STOP);
        break;
#endif

#ifdef CONFIG_STM32_TIM8
      case 8:
        g_tickless.base = STM32_TIM8_BASE;
        modifyreg32(STM32_DBGMCU_APB2FZ1, 0, DBGMCU_APB2Z1_TIM8STOP);
        break;
#endif

#ifdef CONFIG_STM32_TIM9
      case 9:
        g_tickless.base = STM32_TIM9_BASE;

        /* A freeze bit for TIM9 doesn't seem to exist */

        break;
#endif
#ifdef CONFIG_STM32_TIM10
      case 10:
        g_tickless.base = STM32_TIM10_BASE;

        /* A freeze bit for TIM10 doesn't seem to exist */

        break;
#endif

#ifdef CONFIG_STM32_TIM11
      case 11:
        g_tickless.base = STM32_TIM11_BASE;

        /* A freeze bit for TIM11 doesn't seem to exist */

        break;
#endif
#ifdef CONFIG_STM32_TIM12
      case 12:
        g_tickless.base = STM32_TIM12_BASE;
        modifyreg32(STM32_DBGMCU_APB1LFZ1, 0, DBGMCU_APB1L_TIM12STOP);
        break;
#endif
#ifdef CONFIG_STM32_TIM13
      case 13:
        g_tickless.base = STM32_TIM13_BASE;
        modifyreg32(STM32_DBGMCU_APB1LFZ1, 0, DBGMCU_APB1L_TIM13STOP);
        break;
#endif

#ifdef CONFIG_STM32_TIM14
      case 14:
        g_tickless.base = STM32_TIM14_BASE;
        modifyreg32(STM32_DBGMCU_APB1LFZ1, 0, DBGMCU_APB1L_TIM14STOP);
        break;
#endif
#ifdef CONFIG_STM32_TIM15
      case 15:
        g_tickless.base = STM32_TIM15_BASE;
        modifyreg32(STM32_DBGMCU_APB2FZ1, 0, DBGMCU_APB2Z1_TIM15STOP);
        break;
#endif

#ifdef CONFIG_STM32_TIM16
      case 16:
        g_tickless.base = STM32_TIM16_BASE;
        modifyreg32(STM32_DBGMCU_APB2FZ1, 0, DBGMCU_APB2Z1_TIM16STOP);
        break;
#endif

