apache/nuttx/arch/arm/src/stm32h7/stm32_tickless.c
      period = (usec * (uint64_t)g_tickless.frequency) / USEC_PER_SEC;
    }

  if (period == 0)
    {
      stm32_tickless_enableint(g_tickless.channel);
      stm32_tickless_trigint(g_tickless.channel);
      g_tickless.pending = true;
      leave_critical_section(flags);
      return OK;
    }

  count  = STM32_TIM_GETCOUNTER(g_tickless.tch);

  tmrinfo("usec=%llu period=%08llx\n", usec, period);

  /* Set interval compare value. Rollover is fine,
   * channel will trigger on the next period.
   */

#ifdef HAVE_32BIT_TICKLESS
  DEBUGASSERT(period <= UINT32_MAX);
  g_tickless.period = (uint32_t)(period + count);
#else
  DEBUGASSERT(period <= UINT16_MAX);
  g_tickless.period = (uint16_t)(period + count);
#endif

  STM32_TIM_SETCOMPARE(g_tickless.tch, g_tickless.channel,
                       g_tickless.period);

  /* Enable interrupts.  We should get the callback when the interrupt
   * occurs.
   */

  stm32_tickless_ackint(g_tickless.channel);
  stm32_tickless_enableint(g_tickless.channel);

  g_tickless.pending = true;

  /* Check if the counter already reached or passed the compare target
   * while we were configuring the registers.
   */

#ifdef HAVE_32BIT_TICKLESS
  if ((uint32_t)(STM32_TIM_GETCOUNTER(g_tickless.tch) - count) >=
      (uint32_t)period)
#else
  if ((uint16_t)(STM32_TIM_GETCOUNTER(g_tickless.tch) - (uint16_t)count) >=
      (uint16_t)period)
#endif
    {
      /* Target time already elapsed; force the interrupt immediately */

      stm32_tickless_trigint(g_tickless.channel);
    }

  leave_critical_section(flags);
  return OK;
}
#endif

#ifdef CONFIG_SCHED_TICKLESS_ALARM
int up_alarm_start(const struct timespec *ts)
{
  size_t offset = 1;
  uint64_t tm = (ts->tv_sec * NSEC_PER_SEC + ts->tv_nsec) /
                NSEC_PER_TICK;
  irqstate_t flags;

  flags = enter_critical_section();

  STM32_TIM_SETCOMPARE(g_tickless.tch, CONFIG_STM32_TICKLESS_CHANNEL, tm);

  stm32_tickless_ackint(g_tickless.channel);
  stm32_tickless_enableint(CONFIG_STM32_TICKLESS_CHANNEL);

  g_tickless.pending = true;

  /* If we have already passed this time, there is a chance we didn't set the
   * compare register in time and we've missed the interrupt. If we don't
   * catch this case, we won't interrupt until a full loop of the clock.
   *
   * Since we can't make assumptions about the clock speed and tick rate,
   * we simply keep adding an offset to the current time, until we can leave
   * certain that the interrupt is going to fire as soon as we leave the
   * critical section.
   */

  while (tm <= stm32_get_counter())
    {
      tm = stm32_get_counter() + offset++;
      STM32_TIM_SETCOMPARE(g_tickless.tch, CONFIG_STM32_TICKLESS_CHANNEL,
                           tm);
    }

  leave_critical_section(flags);
  return OK;
}

int up_alarm_cancel(struct timespec *ts)
{
#ifdef HAVE_32BIT_TICKLESS
  uint64_t nsecs = (((uint64_t)g_tickless.overflow << 32) |
                    STM32_TIM_GETCOUNTER(g_tickless.tch)) * NSEC_PER_TICK;
#else
  uint64_t nsecs = (((uint64_t)g_tickless.overflow << 16) |
                    STM32_TIM_GETCOUNTER(g_tickless.tch)) * NSEC_PER_TICK;
#endif

  ts->tv_sec = nsecs / NSEC_PER_SEC;
  ts->tv_nsec = nsecs - ts->tv_sec * NSEC_PER_SEC;

  stm32_tickless_disableint(CONFIG_STM32_TICKLESS_CHANNEL);

  return 0;
}
#endif

#endif /* CONFIG_SCHED_TICKLESS */
